MaJerle/stm32f429/00-STM32_SVD/STM32F401x.svd
<?xml version="1.0" encoding="UTF-8" standalone="no" ?><device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd"><name>STM32F401x</name><version>1.0</version><description>STM32F401x</description><!--Bus Interface Properties--><!--Cortex-M4 is byte addressable--><addressUnitBits>8</addressUnitBits><!--the maximum data bit width accessible within a single transfer--><width>32</width><!--Register Default Properties--><size>0x20</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><peripherals><peripheral><name>DBG</name><description>Debug support</description><groupName>DBG</groupName><baseAddress>0xE0042000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>DBGMCU_IDCODE</name><displayName>DBGMCU_IDCODE</displayName><description>IDCODE</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x10006411</resetValue><fields><field><name>DEV_ID</name><description>DEV_ID</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field><field><name>REV_ID</name><description>REV_ID</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DBGMCU_CR</name><displayName>DBGMCU_CR</displayName><description>Control Register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DBG_SLEEP</name><description>DBG_SLEEP</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_STOP</name><description>DBG_STOP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_STANDBY</name><description>DBG_STANDBY</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TRACE_IOEN</name><description>TRACE_IOEN</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TRACE_MODE</name><description>TRACE_MODE</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>DBGMCU_APB1_FZ</name><displayName>DBGMCU_APB1_FZ</displayName><description>Debug MCU APB1 Freeze registe</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DBG_TIM2_STOP</name><description>DBG_TIM2_STOP</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM3_STOP</name><description>DBG_TIM3 _STOP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM4_STOP</name><description>DBG_TIM4_STOP</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM5_STOP</name><description>DBG_TIM5_STOP</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_WWDG_STOP</name><description>DBG_WWDG_STOP</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_IWDEG_STOP</name><description>DBG_IWDEG_STOP</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_I2C1_SMBUS_TIMEOUT</name><description>DBG_J2C1_SMBUS_TIMEOUT</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_I2C2_SMBUS_TIMEOUT</name><description>DBG_J2C2_SMBUS_TIMEOUT</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_I2C3SMBUS_TIMEOUT</name><description>DBG_J2C3SMBUS_TIMEOUT</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DBGMCU_APB2_FZ</name><displayName>DBGMCU_APB2_FZ</displayName><description>Debug MCU APB2 Freeze registe</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DBG_TIM1_STOP</name><description>TIM1 counter stopped when core is               halted</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM9_STOP</name><description>TIM9 counter stopped when core is               halted</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM10_STOP</name><description>TIM10 counter stopped when core is               halted</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIM11_STOP</name><description>TIM11 counter stopped when core is               halted</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>DMA2</name><description>DMA controller</description><groupName>DMA</groupName><baseAddress>0x40026400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>DMA2_Stream0</name><description>DMA2 Stream0 global interrupt</description><value>56</value></interrupt><interrupt><name>DMA2_Stream1</name><description>DMA2 Stream1 global interrupt</description><value>57</value></interrupt><interrupt><name>DMA2_Stream2</name><description>DMA2 Stream2 global interrupt</description><value>58</value></interrupt><interrupt><name>DMA2_Stream3</name><description>DMA2 Stream3 global interrupt</description><value>59</value></interrupt><interrupt><name>DMA2_Stream4</name><description>DMA2 Stream4 global interrupt</description><value>60</value></interrupt><interrupt><name>DMA2_Stream5</name><description>DMA2 Stream5 global interrupt</description><value>68</value></interrupt><interrupt><name>DMA2_Stream6</name><description>DMA2 Stream6 global interrupt</description><value>69</value></interrupt><interrupt><name>DMA2_Stream7</name><description>DMA2 Stream7 global interrupt</description><value>70</value></interrupt><registers><register><name>LISR</name><displayName>LISR</displayName><description>low interrupt status register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>TCIF3</name><description>Stream x transfer complete interrupt               flag (x = 3..0)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF3</name><description>Stream x half transfer interrupt flag               (x=3..0)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF3</name><description>Stream x transfer error interrupt flag               (x=3..0)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIF3</name><description>Stream x direct mode error interrupt               flag (x=3..0)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FEIF3</name><description>Stream x FIFO error interrupt flag               (x=3..0)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF2</name><description>Stream x transfer complete interrupt               flag (x = 3..0)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF2</name><description>Stream x half transfer interrupt flag               (x=3..0)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF2</name><description>Stream x transfer error interrupt flag               (x=3..0)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIF2</name><description>Stream x direct mode error interrupt               flag (x=3..0)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FEIF2</name><description>Stream x FIFO error interrupt flag               (x=3..0)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF1</name><description>Stream x transfer complete interrupt               flag (x = 3..0)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF1</name><description>Stream x half transfer interrupt flag               (x=3..0)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF1</name><description>Stream x transfer error interrupt flag               (x=3..0)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIF1</name><description>Stream x direct mode error interrupt               flag (x=3..0)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FEIF1</name><description>Stream x FIFO error interrupt flag               (x=3..0)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF0</name><description>Stream x transfer complete interrupt               flag (x = 3..0)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF0</name><description>Stream x half transfer interrupt flag               (x=3..0)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF0</name><description>Stream x transfer error interrupt flag               (x=3..0)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIF0</name><description>Stream x direct mode error interrupt               flag (x=3..0)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FEIF0</name><description>Stream x FIFO error interrupt flag               (x=3..0)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>HISR</name><displayName>HISR</displayName><description>high interrupt status register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>TCIF7</name><description>Stream x transfer complete interrupt               flag (x=7..4)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF7</name><description>Stream x half transfer interrupt flag               (x=7..4)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF7</name><description>Stream x transfer error interrupt flag               (x=7..4)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIF7</name><description>Stream x direct mode error interrupt               flag (x=7..4)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FEIF7</name><description>Stream x FIFO error interrupt flag               (x=7..4)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF6</name><description>Stream x transfer complete interrupt               flag (x=7..4)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF6</name><description>Stream x half transfer interrupt flag               (x=7..4)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF6</name><description>Stream x transfer error interrupt flag               (x=7..4)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIF6</name><description>Stream x direct mode error interrupt               flag (x=7..4)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FEIF6</name><description>Stream x FIFO error interrupt flag               (x=7..4)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF5</name><description>Stream x transfer complete interrupt               flag (x=7..4)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF5</name><description>Stream x half transfer interrupt flag               (x=7..4)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF5</name><description>Stream x transfer error interrupt flag               (x=7..4)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIF5</name><description>Stream x direct mode error interrupt               flag (x=7..4)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FEIF5</name><description>Stream x FIFO error interrupt flag               (x=7..4)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF4</name><description>Stream x transfer complete interrupt               flag (x=7..4)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF4</name><description>Stream x half transfer interrupt flag               (x=7..4)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF4</name><description>Stream x transfer error interrupt flag               (x=7..4)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIF4</name><description>Stream x direct mode error interrupt               flag (x=7..4)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FEIF4</name><description>Stream x FIFO error interrupt flag               (x=7..4)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>LIFCR</name><displayName>LIFCR</displayName><description>low interrupt flag clear           register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>CTCIF3</name><description>Stream x clear transfer complete               interrupt flag (x = 3..0)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF3</name><description>Stream x clear half transfer interrupt               flag (x = 3..0)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF3</name><description>Stream x clear transfer error interrupt               flag (x = 3..0)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>CDMEIF3</name><description>Stream x clear direct mode error               interrupt flag (x = 3..0)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>CFEIF3</name><description>Stream x clear FIFO error interrupt flag               (x = 3..0)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF2</name><description>Stream x clear transfer complete               interrupt flag (x = 3..0)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF2</name><description>Stream x clear half transfer interrupt               flag (x = 3..0)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF2</name><description>Stream x clear transfer error interrupt               flag (x = 3..0)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>CDMEIF2</name><description>Stream x clear direct mode error               interrupt flag (x = 3..0)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>CFEIF2</name><description>Stream x clear FIFO error interrupt flag               (x = 3..0)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF1</name><description>Stream x clear transfer complete               interrupt flag (x = 3..0)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF1</name><description>Stream x clear half transfer interrupt               flag (x = 3..0)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF1</name><description>Stream x clear transfer error interrupt               flag (x = 3..0)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CDMEIF1</name><description>Stream x clear direct mode error               interrupt flag (x = 3..0)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CFEIF1</name><description>Stream x clear FIFO error interrupt flag               (x = 3..0)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF0</name><description>Stream x clear transfer complete               interrupt flag (x = 3..0)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF0</name><description>Stream x clear half transfer interrupt               flag (x = 3..0)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF0</name><description>Stream x clear transfer error interrupt               flag (x = 3..0)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CDMEIF0</name><description>Stream x clear direct mode error               interrupt flag (x = 3..0)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CFEIF0</name><description>Stream x clear FIFO error interrupt flag               (x = 3..0)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>HIFCR</name><displayName>HIFCR</displayName><description>high interrupt flag clear           register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>CTCIF7</name><description>Stream x clear transfer complete               interrupt flag (x = 7..4)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF7</name><description>Stream x clear half transfer interrupt               flag (x = 7..4)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF7</name><description>Stream x clear transfer error interrupt               flag (x = 7..4)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>CDMEIF7</name><description>Stream x clear direct mode error               interrupt flag (x = 7..4)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>CFEIF7</name><description>Stream x clear FIFO error interrupt flag               (x = 7..4)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF6</name><description>Stream x clear transfer complete               interrupt flag (x = 7..4)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF6</name><description>Stream x clear half transfer interrupt               flag (x = 7..4)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF6</name><description>Stream x clear transfer error interrupt               flag (x = 7..4)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>CDMEIF6</name><description>Stream x clear direct mode error               interrupt flag (x = 7..4)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>CFEIF6</name><description>Stream x clear FIFO error interrupt flag               (x = 7..4)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF5</name><description>Stream x clear transfer complete               interrupt flag (x = 7..4)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF5</name><description>Stream x clear half transfer interrupt               flag (x = 7..4)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF5</name><description>Stream x clear transfer error interrupt               flag (x = 7..4)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CDMEIF5</name><description>Stream x clear direct mode error               interrupt flag (x = 7..4)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CFEIF5</name><description>Stream x clear FIFO error interrupt flag               (x = 7..4)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF4</name><description>Stream x clear transfer complete               interrupt flag (x = 7..4)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF4</name><description>Stream x clear half transfer interrupt               flag (x = 7..4)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF4</name><description>Stream x clear transfer error interrupt               flag (x = 7..4)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CDMEIF4</name><description>Stream x clear direct mode error               interrupt flag (x = 7..4)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CFEIF4</name><description>Stream x clear FIFO error interrupt flag               (x = 7..4)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>S0CR</name><displayName>S0CR</displayName><description>stream x configuration           register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth></field><field><name>MBURST</name><description>Memory burst transfer               configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth></field><field><name>PBURST</name><description>Peripheral burst transfer               configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth></field><field><name>CT</name><description>Current target (only in double buffer               mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>PINCOS</name><description>Peripheral increment offset               size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIE</name><description>Direct mode error interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Stream enable / flag stream ready when               read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>S0NDTR</name><displayName>S0NDTR</displayName><description>stream x number of data           register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data items to               transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></f