MaJerle/stm32f429/00-STM32_SVD/STM32F401x.svd
ields></register><register><name>S0PAR</name><displayName>S0PAR</displayName><description>stream x peripheral address           register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S0M0AR</name><displayName>S0M0AR</displayName><description>stream x memory 0 address           register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S0M1AR</name><displayName>S0M1AR</displayName><description>stream x memory 1 address           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double               buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S0FCR</name><displayName>S0FCR</displayName><description>stream x FIFO control register</description><addressOffset>0x24</addressOffset><size>0x20</size><resetValue>0x00000021</resetValue><fields><field><name>FEIE</name><description>FIFO error interrupt               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S1CR</name><displayName>S1CR</displayName><description>stream x configuration           register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth></field><field><name>MBURST</name><description>Memory burst transfer               configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth></field><field><name>PBURST</name><description>Peripheral burst transfer               configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CT</name><description>Current target (only in double buffer               mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>PINCOS</name><description>Peripheral increment offset               size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIE</name><description>Direct mode error interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Stream enable / flag stream ready when               read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>S1NDTR</name><displayName>S1NDTR</displayName><description>stream x number of data           register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data items to               transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>S1PAR</name><displayName>S1PAR</displayName><description>stream x peripheral address           register</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S1M0AR</name><displayName>S1M0AR</displayName><description>stream x memory 0 address           register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S1M1AR</name><displayName>S1M1AR</displayName><description>stream x memory 1 address           register</description><addressOffset>0x38</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double               buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S1FCR</name><displayName>S1FCR</displayName><description>stream x FIFO control register</description><addressOffset>0x3C</addressOffset><size>0x20</size><resetValue>0x00000021</resetValue><fields><field><name>FEIE</name><description>FIFO error interrupt               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S2CR</name><displayName>S2CR</displayName><description>stream x configuration           register</description><addressOffset>0x40</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth></field><field><name>MBURST</name><description>Memory burst transfer               configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth></field><field><name>PBURST</name><description>Peripheral burst transfer               configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CT</name><description>Current target (only in double buffer               mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>PINCOS</name><description>Peripheral increment offset               size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIE</name><description>Direct mode error interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Stream enable / flag stream ready when               read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>S2NDTR</name><displayName>S2NDTR</displayName><description>stream x number of data           register</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data items to               transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>S2PAR</name><displayName>S2PAR</displayName><description>stream x peripheral address           register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S2M0AR</name><displayName>S2M0AR</displayName><description>stream x memory 0 address           register</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S2M1AR</name><displayName>S2M1AR</displayName><description>stream x memory 1 address           register</description><addressOffset>0x50</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double               buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S2FCR</name><displayName>S2FCR</displayName><description>stream x FIFO control register</description><addressOffset>0x54</addressOffset><size>0x20</size><resetValue>0x00000021</resetValue><fields><field><name>FEIE</name><description>FIFO error interrupt               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S3CR</name><displayName>S3CR</displayName><description>stream x configuration           register</description><addressOffset>0x58</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth></field><field><name>MBURST</name><description>Memory burst transfer               configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth></field><field><name>PBURST</name><description>Peripheral burst transfer               configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CT</name><description>Current target (only in double buffer               mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>PINCOS</name><description>Peripheral increment offset               size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIE</name><description>Direct mode error interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Stream enable / flag stream ready when               read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>S3NDTR</name><displayName>S3NDTR</displayName><description>stream x number of data           register</description><addressOffset>0x5C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data items to               transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>S3PAR</name><displayName>S3PAR</displayName><description>stream x peripheral address           register</description><addressOffset>0x60</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S3M0AR</name><displayName>S3M0AR</displayName><description>stream x memory 0 address           register</description><addressOffset>0x64</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S3M1AR</name><displayName>S3M1AR</displayName><description>stream x memory 1 address           register</description><addressOffset>0x68</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double               buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S3FCR</name><displayName>S3FCR</displayName><description>stream x FIFO control register</description><addressOffset>0x6C</addressOffset><size>0x20</size><resetValue>0x00000021</resetValue><fields><field><name>FEIE</name><description>FIFO error interrupt               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S4CR</name><displayName>S4CR</displayName><description>stream x configuration           register</description><addressOffset>0x70</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth></field><field><name>MBURST</name><description>Memory burst transfer               configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth></field><field><name>PBURST</name><description>Peripheral burst transfer               configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CT</name><description>Current target (only in double buffer               mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>PINCOS</name><description>Peripheral increment offset               size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIE</name><description>Direct mode error interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Stream enable / flag stream ready when               read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>S4NDTR</name><displayName>S4NDTR</displayName><description>stream x number of data           register</description><addressOffset>0x74</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data items to               transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>S4PAR</name><displayName>S4PAR</displayName><description>stream x peripheral address           register</description><addressOffset>0x78</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S4M0AR</name><displayName>S4M0AR</displayName><description>stream x memory 0 address           register</description><addressOffset>0x7C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S4M1AR</name><displayName>S4M1AR</displayName><description>stream x memory 1 address           register</description><addressOffset>0x80</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double               buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S4FCR</name><displayName>S4FCR</displayName><description>stream x FIFO control register</description><addressOffset>0x84</addressOffset><size>0x20</size><resetValue>0x00000021</resetValue><fields><field><name>FEIE</name><description>FIFO error interrupt               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>