MaJerle/stm32f429/00-STM32_SVD/STM32F401x.svd
Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S5CR</name><displayName>S5CR</displayName><description>stream x configuration           register</description><addressOffset>0x88</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth></field><field><name>MBURST</name><description>Memory burst transfer               configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth></field><field><name>PBURST</name><description>Peripheral burst transfer               configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CT</name><description>Current target (only in double buffer               mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>PINCOS</name><description>Peripheral increment offset               size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIE</name><description>Direct mode error interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Stream enable / flag stream ready when               read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>S5NDTR</name><displayName>S5NDTR</displayName><description>stream x number of data           register</description><addressOffset>0x8C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data items to               transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>S5PAR</name><displayName>S5PAR</displayName><description>stream x peripheral address           register</description><addressOffset>0x90</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S5M0AR</name><displayName>S5M0AR</displayName><description>stream x memory 0 address           register</description><addressOffset>0x94</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S5M1AR</name><displayName>S5M1AR</displayName><description>stream x memory 1 address           register</description><addressOffset>0x98</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double               buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S5FCR</name><displayName>S5FCR</displayName><description>stream x FIFO control register</description><addressOffset>0x9C</addressOffset><size>0x20</size><resetValue>0x00000021</resetValue><fields><field><name>FEIE</name><description>FIFO error interrupt               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S6CR</name><displayName>S6CR</displayName><description>stream x configuration           register</description><addressOffset>0xA0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth></field><field><name>MBURST</name><description>Memory burst transfer               configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth></field><field><name>PBURST</name><description>Peripheral burst transfer               configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CT</name><description>Current target (only in double buffer               mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>PINCOS</name><description>Peripheral increment offset               size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIE</name><description>Direct mode error interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Stream enable / flag stream ready when               read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>S6NDTR</name><displayName>S6NDTR</displayName><description>stream x number of data           register</description><addressOffset>0xA4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data items to               transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>S6PAR</name><displayName>S6PAR</displayName><description>stream x peripheral address           register</description><addressOffset>0xA8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S6M0AR</name><displayName>S6M0AR</displayName><description>stream x memory 0 address           register</description><addressOffset>0xAC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S6M1AR</name><displayName>S6M1AR</displayName><description>stream x memory 1 address           register</description><addressOffset>0xB0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double               buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S6FCR</name><displayName>S6FCR</displayName><description>stream x FIFO control register</description><addressOffset>0xB4</addressOffset><size>0x20</size><resetValue>0x00000021</resetValue><fields><field><name>FEIE</name><description>FIFO error interrupt               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S7CR</name><displayName>S7CR</displayName><description>stream x configuration           register</description><addressOffset>0xB8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth></field><field><name>MBURST</name><description>Memory burst transfer               configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth></field><field><name>PBURST</name><description>Peripheral burst transfer               configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CT</name><description>Current target (only in double buffer               mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>PINCOS</name><description>Peripheral increment offset               size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DMEIE</name><description>Direct mode error interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Stream enable / flag stream ready when               read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>S7NDTR</name><displayName>S7NDTR</displayName><description>stream x number of data           register</description><addressOffset>0xBC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data items to               transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>S7PAR</name><displayName>S7PAR</displayName><description>stream x peripheral address           register</description><addressOffset>0xC0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S7M0AR</name><displayName>S7M0AR</displayName><description>stream x memory 0 address           register</description><addressOffset>0xC4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S7M1AR</name><displayName>S7M1AR</displayName><description>stream x memory 1 address           register</description><addressOffset>0xC8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double               buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>S7FCR</name><displayName>S7FCR</displayName><description>stream x FIFO control register</description><addressOffset>0xCC</addressOffset><size>0x20</size><resetValue>0x00000021</resetValue><fields><field><name>FEIE</name><description>FIFO error interrupt               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral derivedFrom="DMA2"><name>DMA1</name><baseAddress>0x40026000</baseAddress><interrupt><name>DMA1_Stream0</name><description>DMA1 Stream0 global interrupt</description><value>11</value></interrupt><interrupt><name>DMA1_Stream1</name><description>DMA1 Stream1 global interrupt</description><value>12</value></interrupt><interrupt><name>DMA1_Stream2</name><description>DMA1 Stream2 global interrupt</description><value>13</value></interrupt><interrupt><name>DMA1_Stream3</name><description>DMA1 Stream3 global interrupt</description><value>14</value></interrupt><interrupt><name>DMA1_Stream4</name><description>DMA1 Stream4 global interrupt</description><value>15</value></interrupt><interrupt><name>DMA1_Stream5</name><description>DMA1 Stream5 global interrupt</description><value>16</value></interrupt><interrupt><name>DMA1_Stream6</name><description>DMA1 Stream6 global interrupt</description><value>17</value></interrupt><interrupt><name>DMA1_Stream7</name><description>DMA1 Stream7 global interrupt</description><value>47</value></interrupt></peripheral><peripheral><name>RCC</name><description>Reset and clock control</description><groupName>RCC</groupName><baseAddress>0x40023800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>RCC</name><description>RCC global interrupt</description><value>5</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>clock control register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000083</resetValue><fields><field><name>PLLI2SRDY</name><description>PLLI2S clock ready flag</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLI2SON</name><description>PLLI2S enable</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDY</name><description>Main PLL (PLL) clock ready               flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLON</name><description>Main PLL (PLL) enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CSSON</name><description>Clock security system               enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSEBYP</name><description>HSE clock bypass</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDY</name><description>HSE clock ready flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSEON</name><description>HSE clock enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSICAL</name><description>Internal high-speed clock               calibration</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>HSITRIM</name><description>Internal high-speed clock               trimming</description><bitOffset>3</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>HSIRDY</name><description>Internal high-speed clock ready               flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSION</name><description>Internal high-speed clock               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>PLLCFGR</name><displayName>PLLCFGR</displayName><description>PLL configuration register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x24003010</resetValue><fields><field><name>PLLQ3</name><description>Main PLL (PLL) division factor for USB               OTG FS, SDIO and random number generator               clocks</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLQ2</name><description>Main PLL (PLL) division factor for USB               OTG FS, SDIO and random number generator               clocks</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLQ1</name><description>Main PLL (PLL) division factor for USB               OTG FS, SDIO and random number generator               clocks</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLQ0</name><description>Main PLL (PLL) division factor for USB               OTG FS, SDIO and random number generator               clocks</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLSRC</name><description>Main PLL(PLL) and audio PLL (PLLI2S)               entry clock source</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLP1</name><description>Main PLL (PLL) division factor for main               system clock</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLP0</name><description>Main PLL (PLL) division factor for main               system clock</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLN8</name><description>Main PLL (PLL) multiplication factor for               VCO</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLN7</name><description>Main PLL (PLL) multiplication factor for               VCO</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLN6</name><description>Main PLL (PLL) multiplication factor for               VCO</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLN5</name><description>Main PLL (PLL) multiplication factor for               VCO</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLN4</name><description>Main PLL (PLL) multiplication factor for               VCO</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLN3</name><description>Main PLL (PLL) multiplication factor for               VCO</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLN2</name><description>Main PLL (PLL) multiplication factor for               VCO</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLN1</name><description>Main PLL (PLL) multiplication factor for               VCO</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLN0</name><description>Main PLL (PLL) multiplication factor for               VCO</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLM5</name><description>Division factor for the main PLL (PLL)               and audio PLL (PLLI2S) input clock</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLM4</name><description>Division factor for the main PLL (PLL)               and audio