MaJerle/stm32f429/00-STM32_SVD/STM32F401x.svd
 PLL (PLLI2S) input clock</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLM3</name><description>Division factor for the main PLL (PLL)               and audio PLL (PLLI2S) input clock</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLM2</name><description>Division factor for the main PLL (PLL)               and audio PLL (PLLI2S) input clock</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLM1</name><description>Division factor for the main PLL (PLL)               and audio PLL (PLLI2S) input clock</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PLLM0</name><description>Division factor for the main PLL (PLL)               and audio PLL (PLLI2S) input clock</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CFGR</name><displayName>CFGR</displayName><description>clock configuration register</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>MCO2</name><description>Microcontroller clock output               2</description><bitOffset>30</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCO2PRE</name><description>MCO2 prescaler</description><bitOffset>27</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MCO1PRE</name><description>MCO1 prescaler</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>I2SSRC</name><description>I2S clock selection</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MCO1</name><description>Microcontroller clock output               1</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>RTCPRE</name><description>HSE division factor for RTC               clock</description><bitOffset>16</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>PPRE2</name><description>APB high-speed prescaler               (APB2)</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PPRE1</name><description>APB Low speed prescaler               (APB1)</description><bitOffset>10</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>HPRE</name><description>AHB prescaler</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>SWS1</name><description>System clock switch status</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SWS0</name><description>System clock switch status</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SW1</name><description>System clock switch</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SW0</name><description>System clock switch</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CIR</name><displayName>CIR</displayName><description>clock interrupt register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>CSSC</name><description>Clock security system interrupt               clear</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>PLLI2SRDYC</name><description>PLLI2S ready interrupt               clear</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>PLLRDYC</name><description>Main PLL(PLL) ready interrupt               clear</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSERDYC</name><description>HSE ready interrupt clear</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSIRDYC</name><description>HSI ready interrupt clear</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>LSERDYC</name><description>LSE ready interrupt clear</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>LSIRDYC</name><description>LSI ready interrupt clear</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>PLLI2SRDYIE</name><description>PLLI2S ready interrupt               enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDYIE</name><description>Main PLL (PLL) ready interrupt               enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDYIE</name><description>HSE ready interrupt enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSIRDYIE</name><description>HSI ready interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSERDYIE</name><description>LSE ready interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSIRDYIE</name><description>LSI ready interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CSSF</name><description>Clock security system interrupt               flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLI2SRDYF</name><description>PLLI2S ready interrupt               flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLRDYF</name><description>Main PLL (PLL) ready interrupt               flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSERDYF</name><description>HSE ready interrupt flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSIRDYF</name><description>HSI ready interrupt flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSERDYF</name><description>LSE ready interrupt flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSIRDYF</name><description>LSI ready interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>AHB1RSTR</name><displayName>AHB1RSTR</displayName><description>AHB1 peripheral reset register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DMA2RST</name><description>DMA2 reset</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>DMA1RST</name><description>DMA2 reset</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCRST</name><description>CRC reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOHRST</name><description>IO port H reset</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOERST</name><description>IO port E reset</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIODRST</name><description>IO port D reset</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOCRST</name><description>IO port C reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOBRST</name><description>IO port B reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOARST</name><description>IO port A reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AHB2RSTR</name><displayName>AHB2RSTR</displayName><description>AHB2 peripheral reset register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OTGFSRST</name><description>USB OTG FS module reset</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1RSTR</name><displayName>APB1RSTR</displayName><description>APB1 peripheral reset register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PWRRST</name><description>Power interface reset</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C3RST</name><description>I2C3 reset</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2RST</name><description>I2C 2 reset</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1RST</name><description>I2C 1 reset</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>UART2RST</name><description>USART 2 reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI3RST</name><description>SPI 3 reset</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2RST</name><description>SPI 2 reset</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDGRST</name><description>Window watchdog reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM5RST</name><description>TIM5 reset</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM4RST</name><description>TIM4 reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3RST</name><description>TIM3 reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM2RST</name><description>TIM2 reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB2RSTR</name><displayName>APB2RSTR</displayName><description>APB2 peripheral reset register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIM11RST</name><description>TIM11 reset</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM10RST</name><description>TIM10 reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM9RST</name><description>TIM9 reset</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>SYSCFGRST</name><description>System configuration controller               reset</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1RST</name><description>SPI 1 reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>SDIORST</name><description>SDIO reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>ADCRST</name><description>ADC interface reset (common to all               ADCs)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>USART6RST</name><description>USART6 reset</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>USART1RST</name><description>USART1 reset</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM1RST</name><description>TIM1 reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AHB1ENR</name><displayName>AHB1ENR</displayName><description>AHB1 peripheral clock register</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00100000</resetValue><fields><field><name>DMA2EN</name><description>DMA2 clock enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>DMA1EN</name><description>DMA1 clock enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCEN</name><description>CRC clock enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOHEN</name><description>IO port H clock enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOEEN</name><description>IO port E clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIODEN</name><description>IO port D clock enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOCEN</name><description>IO port C clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOBEN</name><description>IO port B clock enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOAEN</name><description>IO port A clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AHB2ENR</name><displayName>AHB2ENR</displayName><description>AHB2 peripheral clock enable           register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OTGFSEN</name><description>USB OTG FS clock enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1ENR</name><displayName>APB1ENR</displayName><description>APB1 peripheral clock enable           register</description><addressOffset>0x40</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PWREN</name><description>Power interface clock               enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C3EN</name><description>I2C3 clock enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2EN</name><description>I2C2 clock enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1EN</name><description>I2C1 clock enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2EN</name><description>USART 2 clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI3EN</name><description>SPI3 clock enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2EN</name><description>SPI2 clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDGEN</name><description>Window watchdog clock               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM5EN</name><description>TIM5 clock enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM4EN</name><description>TIM4 clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3EN</name><description>TIM3 clock enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM2EN</name><description>TIM2 clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB2ENR</name><displayName>APB2ENR</displayName><description>APB2 peripheral clock enable           register</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIM11EN</name><description>TIM11 clock enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM10EN</name><description>TIM10 clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM9EN</name><description>TIM9 clock enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>SYSCFGEN</name><description>System configuration controller clock               enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1EN</name><description>SPI1 clock enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>SDIOEN</name><description>SDIO clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC1EN</name><description>ADC1 clock enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>USART6EN</name><description>USART6 clock enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>USART1EN</name><description>USART1 clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM1EN</name><description>TIM1 clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AHB1LPENR</name><displayName>AHB1LPENR</displayName><description>AHB1 peripheral clock enable in low power           mode register</description><addressOffset>0x50</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x7E6791FF</resetValue><fields><field><name>DMA2LPEN</name><description>DMA2 clock enable during Sleep               mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>DMA1LPEN</name><description>DMA1 clock enable during Sleep               mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>SRAM1LPEN</name><description>SRAM 1interface clock enable during               Sleep mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FLITFLPEN</name><description>Flash interface clock enable during               Sleep mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCLPEN</name><description>CRC clock enable during Sleep               mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOHLPEN</name><description>IO port H clock enable during Sleep               mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOELPEN</name><description>IO port E clock enable during Sleep               mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIODLPEN</name><description>IO port D clock enable during Sleep               mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOCLPEN</name><description>IO port C clock enable during Sleep               mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOBLPEN</name><description>IO port B clock enable during Sleep               mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOALPEN</name><description>IO port A clock enable during sleep               mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AHB2LPENR</name><displayName>AHB2LPENR</displayName><description>AHB2 peripheral clock enable in low power           mode register</description><addressOffset>0x54</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x000000F1</resetValue><fields><field><name>OTGFSLPEN</name><description>USB OTG FS clock enable during Sleep               mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1LPENR</name><displayName>APB1LPENR</displayName><description>APB1 peripheral clock enable in low power           mode register</description><addressOffset>0x60</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x36FEC9FF</resetValue><fields><field><name>PWRLPEN</name><description>Power interface clock enable during               Sleep mode</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C3LPEN</name><description>I2C3 clock enable during Sleep               mode</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2LPEN</name><description>I2C2 clock enable during Sleep               mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1LPEN</name><description>I2C1 clock enable during Sleep               mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2LPEN</name><description>USART2 clock enable during Sleep               mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI3LPEN</name><description>SPI3 clock enable during Sleep               mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2LPEN</name><description>SPI2 clock enable during Sleep               mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDGLPEN</name><description>Window watchdog clock enable during               Sleep mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM5LPEN</name><description>TIM5 clock enable during Sleep               mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM4LPEN</name><description>TIM4 clock enable during Sleep               mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3LPEN</name><description>TIM3 clock enable during Sleep               mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM2LPEN</name><description>TIM2 clock enable during Sleep               mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB2LPENR</name><displayName>APB2LPENR</displayName><description>APB2 peripheral clock enabled in low power           mode register</description><addressOffset>0x64</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00075F33</resetValue><fields><field><name>TIM11LPEN</name><description>TIM11 clock enable during Sleep               mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM10LPEN</name><description>TIM10 clock enable during Sleep               mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM9LPEN</name><description>TIM9 clock enable during sleep               mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>SYSCFGLPEN</name><description>System configuration controller clock               enable during Sleep mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1LPEN</name><description>SPI 1 clock enable during Sleep               mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>SDIOLPEN</name><description>SDIO clock enable during Sleep               mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC1LPEN</name><description>ADC1 clock enable during Sleep               mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>USART6LPEN</name><description>USART6 clock enable during Sleep               mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>USART1LPEN</name><description>USART1 clock enable during Sleep               mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM1LPEN</name><description>TIM1 clock enable during Sleep               mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BDCR</name><displayName>BDCR</displayName><description>Backup domain control register</description><addressOffset>0x70</addressOffset><size>0x20</size><reset