MaJerle/stm32f429/00-STM32_SVD/STM32F401x.svd
><description>CTS interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CTSE</name><description>CTS enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>RTSE</name><description>RTS enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAT</name><description>DMA enable transmitter</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAR</name><description>DMA enable receiver</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>SCEN</name><description>Smartcard mode enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NACK</name><description>Smartcard NACK enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>HDSEL</name><description>Half-duplex selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IRLP</name><description>IrDA low-power</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>IREN</name><description>IrDA mode enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EIE</name><description>Error interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>GTPR</name><displayName>GTPR</displayName><description>Guard time and prescaler           register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>GT</name><description>Guard time value</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>PSC</name><description>Prescaler value</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="USART6"><name>USART1</name><baseAddress>0x40011000</baseAddress><interrupt><name>USART1</name><description>USART1 global interrupt</description><value>37</value></interrupt></peripheral><peripheral derivedFrom="USART6"><name>USART2</name><baseAddress>0x40004400</baseAddress><interrupt><name>USART2</name><description>USART2 global interrupt</description><value>38</value></interrupt></peripheral><peripheral><name>PWR</name><description>Power control</description><groupName>PWR</groupName><baseAddress>0x40007000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>PVD</name><description>PVD through EXTI line detection
        interrupt</description><value>1</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>power control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>VOS</name><description>Regulator voltage scaling output selection</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth></field><field><name>ADCDC1</name><description>ADCDC1</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FPDS</name><description>Flash power down in Stop               mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DBP</name><description>Disable backup domain write               protection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>PLS</name><description>PVD level selection</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth></field><field><name>PVDE</name><description>Power voltage detector               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CSBF</name><description>Clear standby flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CWUF</name><description>Clear wakeup flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>PDDS</name><description>Power down deepsleep</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LPDS</name><description>Low-power deep sleep</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CSR</name><displayName>CSR</displayName><description>power control/status register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>WUF</name><description>Wakeup flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SBF</name><description>Standby flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PVDO</name><description>PVD output</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BRR</name><description>Backup regulator ready</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EWUP</name><description>Enable WKUP pin</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BRE</name><description>Backup regulator enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VOSRDY</name><description>Regulator voltage scaling output               selection ready bit</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>I2C3</name><description>Inter-integrated circuit</description><groupName>I2C</groupName><baseAddress>0x40005C00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>I2C3_EV</name><description>I2C3 event interrupt</description><value>72</value></interrupt><interrupt><name>I2C3_ER</name><description>I2C3 error interrupt</description><value>73</value></interrupt><registers><register><name>CR1</name><displayName>CR1</displayName><description>Control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>SWRST</name><description>Software reset</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>ALERT</name><description>SMBus alert</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>PEC</name><description>Packet error checking</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>POS</name><description>Acknowledge/PEC Position (for data               reception)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>ACK</name><description>Acknowledge enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>STOP</name><description>Stop generation</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>START</name><description>Start generation</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>NOSTRETCH</name><description>Clock stretching disable (Slave               mode)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ENGC</name><description>General call enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>ENPEC</name><description>PEC enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ENARP</name><description>ARP enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBTYPE</name><description>SMBus type</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBUS</name><description>SMBus mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PE</name><description>Peripheral enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>Control register 2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>LAST</name><description>DMA last transfer</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAEN</name><description>DMA requests enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>ITBUFEN</name><description>Buffer interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>ITEVTEN</name><description>Event interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ITERREN</name><description>Error interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FREQ</name><description>Peripheral clock frequency</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field></fields></register><register><name>OAR1</name><displayName>OAR1</displayName><description>Own address register 1</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>ADDMODE</name><description>Addressing mode (slave               mode)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD10</name><description>Interface address</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>ADD7</name><description>Interface address</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field><field><name>ADD0</name><description>Interface address</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OAR2</name><displayName>OAR2</displayName><description>Own address register 2</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>ADD2</name><description>Interface address</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field><field><name>ENDUAL</name><description>Dual addressing mode               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DR</name><displayName>DR</displayName><description>Data register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>DR</name><description>8-bit data register</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>SR1</name><displayName>SR1</displayName><description>Status register 1</description><addressOffset>0x14</addressOffset><size>0x20</size><resetValue>0x0000</resetValue><fields><field><name>SMBALERT</name><description>SMBus alert</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIMEOUT</name><description>Timeout or Tlow error</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PECERR</name><description>PEC Error in reception</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OVR</name><description>Overrun/Underrun</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AF</name><description>Acknowledge failure</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ARLO</name><description>Arbitration lost (master               mode)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERR</name><description>Bus error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TxE</name><description>Data register empty               (transmitters)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RxNE</name><description>Data register not empty               (receivers)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>STOPF</name><description>Stop detection (slave               mode)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ADD10</name><description>10-bit header sent (Master               mode)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BTF</name><description>Byte transfer finished</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ADDR</name><description>Address sent (master mode)/matched               (slave mode)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SB</name><description>Start bit (Master mode)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>SR2</name><displayName>SR2</displayName><description>Status register 2</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x0000</resetValue><fields><field><name>PEC</name><description>acket error checking               register</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DUALF</name><description>Dual flag (Slave mode)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBHOST</name><description>SMBus host header (Slave               mode)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBDEFAULT</name><description>SMBus device default address (Slave               mode)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>GENCALL</name><description>General call address (Slave               mode)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TRA</name><description>Transmitter/receiver</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BUSY</name><description>Bus busy</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MSL</name><description>Master/slave</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR</name><displayName>CCR</displayName><description>Clock control register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>F_S</name><description>I2C master mode selection</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>DUTY</name><description>Fast mode duty cycle</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CCR</name><description>Clock control register in Fast/Standard               mode (Master mode)</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>TRISE</name><displayName>TRISE</displayName><description>TRISE register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0002</resetValue><fields><field><name>TRISE</name><description>Maximum rise time in Fast/Standard mode               (Master mode)</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="I2C3"><name>I2C2</name><baseAddress>0x40005800</baseAddress><interrupt><name>I2C2_EV</name><description>I2C2 event interrupt</description><value>33</value></interrupt><interrupt><name>I2C2_ER</name><description>I2C2 error interrupt</description><value>34</value></interrupt></peripheral><peripheral derivedFrom="I2C3"><name>I2C1</name><baseAddress>0x40005400</baseAddress><interrupt><name>I2C1_EV</name><description>I2C1 event interrupt</description><value>31</value></interrupt><interrupt><name>I2C1_ER</name><description>I2C1 error interrupt</description><value>32</value></interrupt></peripheral><peripheral><name>IWDG</name><description>Independent watchdog</description><groupName>IWDG</groupName><baseAddress>0x40003000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>KR</name><displayName>KR</displayName><description>Key register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>KEY</name><description>Key value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>PR</name><displayName>PR</displayName><description>Prescaler register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PR</name><description>Prescaler divider</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>RLR</name><displayName>RLR</displayName><description>Reload register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000FFF</resetValue><fields><field><name>RL</name><description>Watchdog counter reload               value</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>Status register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>RVU</name><description>Watchdog counter reload value               update</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PVU</name><description>Watchdog prescaler value               update</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>WWDG</name><description>Window watchdog</description><groupName>WWDG</groupName><baseAddress>0x40002C00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>WWDG</name><description>Window Watchdog interrupt</description><value>0</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>Control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x7F</resetValue><fields><field><name>WDGA</name><description>Activation bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>T</name><description>7-bit counter (MSB to LSB)</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field></fields></register><register><name>CFR</name><displayName>CFR</displayName><description>Configuration register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x7F</resetValue><fields><field><name>EWI</name><description>Early wakeup interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>WDGTB1</name><description>Timer base</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>WDGTB0</name><description>Timer base</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>W</name><description>7-bit window value</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>Status register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00</resetValue><fields><field><name>EWIF</name><description>Early wakeup interrupt               flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>RTC</name><description>Real-time clock</description><groupName>RTC</groupName><baseAddress>0x40002800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>RTC_WKUP</name><description>RTC Wakeup interrupt through the EXTI
        line</description><value>3</value></interrupt><interrupt><name>RTC_Alarm</name><description>RTC Alarms (A and B) through EXTI line
