MaJerle/stm32f429/00-STM32_SVD/STM32F401x.svd
        interrupt</description><value>67</value></interrupt><registers><register><name>FS_GOTGCTL</name><displayName>FS_GOTGCTL</displayName><description>OTG_FS control and status register           (OTG_FS_GOTGCTL)</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000800</resetValue><fields><field><name>SRQSCS</name><description>Session request success</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SRQ</name><description>Session request</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HNGSCS</name><description>Host negotiation success</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HNPRQ</name><description>HNP request</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSHNPEN</name><description>Host set HNP enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DHNPEN</name><description>Device HNP enabled</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIDSTS</name><description>Connector ID status</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DBCT</name><description>Long/short debounce time</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ASVLD</name><description>A-session valid</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BSVLD</name><description>B-session valid</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>FS_GOTGINT</name><displayName>FS_GOTGINT</displayName><description>OTG_FS interrupt register           (OTG_FS_GOTGINT)</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SEDET</name><description>Session end detected</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SRSSCHG</name><description>Session request success status               change</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>HNSSCHG</name><description>Host negotiation success status               change</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>HNGDET</name><description>Host negotiation detected</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>ADTOCHG</name><description>A-device timeout change</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>DBCDNE</name><description>Debounce done</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_GAHBCFG</name><displayName>FS_GAHBCFG</displayName><description>OTG_FS AHB configuration register           (OTG_FS_GAHBCFG)</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>GINT</name><description>Global interrupt mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TXFELVL</name><description>TxFIFO empty level</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PTXFELVL</name><description>Periodic TxFIFO empty               level</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_GUSBCFG</name><displayName>FS_GUSBCFG</displayName><description>OTG_FS USB configuration register           (OTG_FS_GUSBCFG)</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000A00</resetValue><fields><field><name>TOCAL</name><description>FS timeout calibration</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PHYSEL</name><description>Full Speed serial transceiver               select</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SRPCAP</name><description>SRP-capable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HNPCAP</name><description>HNP-capable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TRDT</name><description>USB turnaround time</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>FHMOD</name><description>Force host mode</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FDMOD</name><description>Force device mode</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTXPKT</name><description>Corrupt Tx packet</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_GRSTCTL</name><displayName>FS_GRSTCTL</displayName><description>OTG_FS reset register           (OTG_FS_GRSTCTL)</description><addressOffset>0x10</addressOffset><size>0x20</size><resetValue>0x20000000</resetValue><fields><field><name>CSRST</name><description>Core soft reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSRST</name><description>HCLK soft reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FCRST</name><description>Host frame counter reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFFLSH</name><description>RxFIFO flush</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFFLSH</name><description>TxFIFO flush</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>6</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>AHBIDL</name><description>AHB master idle</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>FS_GINTSTS</name><displayName>FS_GINTSTS</displayName><description>OTG_FS core interrupt register           (OTG_FS_GINTSTS)</description><addressOffset>0x14</addressOffset><size>0x20</size><resetValue>0x04000020</resetValue><fields><field><name>CMOD</name><description>Current mode of operation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>MMIS</name><description>Mode mismatch interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTGINT</name><description>OTG interrupt</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SOF</name><description>Start of frame</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFLVL</name><description>RxFIFO non-empty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NPTXFE</name><description>Non-periodic TxFIFO empty</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>GINAKEFF</name><description>Global IN non-periodic NAK               effective</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>GOUTNAKEFF</name><description>Global OUT NAK effective</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ESUSP</name><description>Early suspend</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBSUSP</name><description>USB suspend</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBRST</name><description>USB reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ENUMDNE</name><description>Enumeration done</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ISOODRP</name><description>Isochronous OUT packet dropped               interrupt</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EOPF</name><description>End of periodic frame               interrupt</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IEPINT</name><description>IN endpoint interrupt</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>OEPINT</name><description>OUT endpoint interrupt</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IISOIXFR</name><description>Incomplete isochronous IN               transfer</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IPXFR_INCOMPISOOUT</name><description>Incomplete periodic transfer(Host               mode)/Incomplete isochronous OUT transfer(Device               mode)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HPRTINT</name><description>Host port interrupt</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HCINT</name><description>Host channels interrupt</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PTXFE</name><description>Periodic TxFIFO empty</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CIDSCHG</name><description>Connector ID status change</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DISCINT</name><description>Disconnect detected               interrupt</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SRQINT</name><description>Session request/new session detected               interrupt</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WKUPINT</name><description>Resume/remote wakeup detected               interrupt</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_GINTMSK</name><displayName>FS_GINTMSK</displayName><description>OTG_FS interrupt mask register           (OTG_FS_GINTMSK)</description><addressOffset>0x18</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>MMISM</name><description>Mode mismatch interrupt               mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTGINT</name><description>OTG interrupt mask</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SOFM</name><description>Start of frame mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFLVLM</name><description>Receive FIFO non-empty               mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NPTXFEM</name><description>Non-periodic TxFIFO empty               mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GINAKEFFM</name><description>Global non-periodic IN NAK effective               mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GONAKEFFM</name><description>Global OUT NAK effective               mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ESUSPM</name><description>Early suspend mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBSUSPM</name><description>USB suspend mask</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBRST</name><description>USB reset mask</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ENUMDNEM</name><description>Enumeration done mask</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ISOODRPM</name><description>Isochronous OUT packet dropped interrupt               mask</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EOPFM</name><description>End of periodic frame interrupt               mask</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPMISM</name><description>Endpoint mismatch interrupt               mask</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IEPINT</name><description>IN endpoints interrupt               mask</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OEPINT</name><description>OUT endpoints interrupt               mask</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IISOIXFRM</name><description>Incomplete isochronous IN transfer               mask</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IPXFRM_IISOOXFRM</name><description>Incomplete periodic transfer mask(Host               mode)/Incomplete isochronous OUT transfer mask(Device               mode)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRTIM</name><description>Host port interrupt mask</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HCIM</name><description>Host channels interrupt               mask</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PTXFEM</name><description>Periodic TxFIFO empty mask</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIDSCHGM</name><description>Connector ID status change               mask</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DISCINT</name><description>Disconnect detected interrupt               mask</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SRQIM</name><description>Session request/new session detected               interrupt mask</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WUIM</name><description>Resume/remote wakeup detected interrupt               mask</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_GRXSTSR_Device</name><displayName>FS_GRXSTSR_Device</displayName><description>OTG_FS Receive status debug read(Device           mode)</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>BCNT</name><description>Byte count</description><bitOffset>4</bitOffset><bitWidth>11</bitWidth></field><field><name>DPID</name><description>Data PID</description><bitOffset>15</bitOffset><bitWidth>2</bitWidth></field><field><name>PKTSTS</name><description>Packet status</description><bitOffset>17</bitOffset><bitWidth>4</bitWidth></field><field><name>FRMNUM</name><description>Frame number</description><bitOffset>21</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>FS_GRXSTSR_Host</name><displayName>FS_GRXSTSR_Host</displayName><description>OTG_FS Receive status debug read(Host           mode)</description><alternateRegister>FS_GRXSTSR_Device</alternateRegister><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>BCNT</name><description>Byte count</description><bitOffset>4</bitOffset><bitWidth>11</bitWidth></field><field><name>DPID</name><description>Data PID</description><bitOffset>15</bitOffset><bitWidth>2</bitWidth></field><field><name>PKTSTS</name><description>Packet status</description><bitOffset>17</bitOffset><bitWidth>4</bitWidth></field><field><name>FRMNUM</name><description>Frame number</description><bitOffset>21</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>FS_GRXFSIZ</name><displayName>FS_GRXFSIZ</displayName><description>OTG_FS Receive FIFO size register           (OTG_FS_GRXFSIZ)</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000200</resetValue><fields><field><name>RXFD</name><description>RxFIFO depth</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>FS_GNPTXFSIZ_Device</name><displayName>FS_GNPTXFSIZ_Device</displayName><description>OTG_FS non-periodic transmit FIFO size           register (Device mode)</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000200</resetValue><fields><field><name>TX0FSA</name><description>Endpoint 0 transmit RAM start               address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>TX0FD</name><description>Endpoint 0 TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>FS_GNPTXFSIZ_Host</name><displayName>FS_GNPTXFSIZ_Host</displayName><description>OTG_FS non-periodic transmit FIFO size           register (Host mode)</description><alternateRegister>FS_GNPTXFSIZ_Device</alternateRegister><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000200</resetValue><fields><field><name>NPTXFSA</name><description>Non-periodic transmit RAM start               address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>NPTXFD</name><description>Non-periodic TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>FS_GNPTXSTS</name><displayName>FS_GNPTXSTS</displayName><description>OTG_FS non-periodic transmit FIFO/queue           status register (OTG_FS_GNPTXSTS)</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00080200</resetValue><fields><field><name>NPTXFSAV</name><description>Non-periodic TxFIFO space               available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>NPTQXSAV</name><description>Non-periodic transmit request queue               space available</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>NPTXQTOP</name><description>Top of the non-periodic transmit request               queue</description><bitOffset>24</bitOffset><bitWidth>7</bitWidth></field></fields></register><register><name>FS_GCCFG</name><displayName>FS_GCCFG</displayName><description>OTG_FS general core configuration register           (OTG_FS_GCCFG)</description><addressOffset>0x38</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PWRDWN</name><description>Power down</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>VBUSASEN</name><description>Enable the VBUS sensing               device</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>VBUSBSEN</name><description>Enable the VBUS sensing               device</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>SOFOUTEN</name><description>SOF output enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_CID</name><displayName>FS_CID</displayName><description>core ID register</description><addressOffset>0x3C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00001000</resetValue><fields><field><name>PRODUCT_ID</name><description>Product ID field</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>FS_HPTXFSIZ</name><displayName>FS_HPTXFSIZ</displayName><description>OTG_FS Host periodic transmit FIFO size           register (OTG_FS_HPTXFSIZ)</description><addressOffset>0x100</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x02000600</resetValue><fields><field><name>PTXSA</name><description>Host periodic TxFIFO start               address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>PTXFSIZ</name><description>Host periodic TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>FS_DIEPTXF1</name><displayName>FS_DIEPTXF1</displayName><description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF2)</description><addressOffset>0x104</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x02000400</resetValue><fields><field><name>INEPTXSA</name><description>IN endpoint FIFO2 transmit RAM start               address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>FS_DIEPTXF2</name><displayName>FS_DIEPTXF2</displayName><description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF3)</description><addressOffset>0x108</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x02000400</resetValue><fields><field><name>INEPTXSA</name><description>IN endpoint FIFO3 transmit RAM start               address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>FS_DIEPTXF3</name><displayName>FS_DIEPTXF3</displayName><description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF4)</description><addressOffset>0x10C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x02000400</resetValue><fields><field><name>INEPTXSA</name><description>IN endpoint FIFO4 transmit RAM start               address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register></registers></peripheral><peripheral><name>OTG_FS_HOST</name><description>USB on the go full speed</description><groupName>USB_OTG_FS</groupName><baseAddress>0x50000400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressB