MaJerle/stm32f429/00-STM32_SVD/STM32F401x.svd
lock><registers><register><name>FS_HCFG</name><displayName>FS_HCFG</displayName><description>OTG_FS host configuration register           (OTG_FS_HCFG)</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>FSLSPCS</name><description>FS/LS PHY clock select</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>FSLSS</name><description>FS- and LS-only support</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>HFIR</name><displayName>HFIR</displayName><description>OTG_FS Host frame interval           register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000EA60</resetValue><fields><field><name>FRIVL</name><description>Frame interval</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>FS_HFNUM</name><displayName>FS_HFNUM</displayName><description>OTG_FS host frame number/frame time           remaining register (OTG_FS_HFNUM)</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00003FFF</resetValue><fields><field><name>FRNUM</name><description>Frame number</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>FTREM</name><description>Frame time remaining</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>FS_HPTXSTS</name><displayName>FS_HPTXSTS</displayName><description>OTG_FS_Host periodic transmit FIFO/queue           status register (OTG_FS_HPTXSTS)</description><addressOffset>0x10</addressOffset><size>0x20</size><resetValue>0x00080100</resetValue><fields><field><name>PTXFSAVL</name><description>Periodic transmit data FIFO space               available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>PTXQSAV</name><description>Periodic transmit request queue space               available</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>PTXQTOP</name><description>Top of the periodic transmit request               queue</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field></fields></register><register><name>HAINT</name><displayName>HAINT</displayName><description>OTG_FS Host all channels interrupt           register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>HAINT</name><description>Channel interrupts</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>HAINTMSK</name><displayName>HAINTMSK</displayName><description>OTG_FS host all channels interrupt mask           register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>HAINTM</name><description>Channel interrupt mask</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>FS_HPRT</name><displayName>FS_HPRT</displayName><description>OTG_FS host port control and status register           (OTG_FS_HPRT)</description><addressOffset>0x40</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>PCSTS</name><description>Port connect status</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PCDET</name><description>Port connect detected</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PENA</name><description>Port enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PENCHNG</name><description>Port enable/disable change</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>POCA</name><description>Port overcurrent active</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>POCCHNG</name><description>Port overcurrent change</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRES</name><description>Port resume</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PSUSP</name><description>Port suspend</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRST</name><description>Port reset</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLSTS</name><description>Port line status</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>PPWR</name><description>Port power</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PTCTL</name><description>Port test control</description><bitOffset>13</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>PSPD</name><description>Port speed</description><bitOffset>17</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>FS_HCCHAR0</name><displayName>FS_HCCHAR0</displayName><description>OTG_FS host channel-0 characteristics           register (OTG_FS_HCCHAR0)</description><addressOffset>0x100</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCCHAR1</name><displayName>FS_HCCHAR1</displayName><description>OTG_FS host channel-1 characteristics           register (OTG_FS_HCCHAR1)</description><addressOffset>0x120</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCCHAR2</name><displayName>FS_HCCHAR2</displayName><description>OTG_FS host channel-2 characteristics           register (OTG_FS_HCCHAR2)</description><addressOffset>0x140</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCCHAR3</name><displayName>FS_HCCHAR3</displayName><description>OTG_FS host channel-3 characteristics           register (OTG_FS_HCCHAR3)</description><addressOffset>0x160</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCCHAR4</name><displayName>FS_HCCHAR4</displayName><description>OTG_FS host channel-4 characteristics           register (OTG_FS_HCCHAR4)</description><addressOffset>0x180</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCCHAR5</name><displayName>FS_HCCHAR5</displayName><description>OTG_FS host channel-5 characteristics           register (OTG_FS_HCCHAR5)</description><addressOffset>0x1A0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCCHAR6</name><displayName>FS_HCCHAR6</displayName><description>OTG_FS host channel-6 characteristics           register (OTG_FS_HCCHAR6)</description><addressOffset>0x1C0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCCHAR7</name><displayName>FS_HCCHAR7</displayName><description>OTG_FS host channel-7 characteristics           register (OTG_FS_HCCHAR7)</description><addressOffset>0x1E0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINT0</name><displayName>FS_HCINT0</displayName><description>OTG_FS host channel-0 interrupt register           (OTG_FS_HCINT0)</description><addressOffset>0x108</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALL</name><description>STALL response received               interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAK</name><description>NAK response received               interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACK</name><description>ACK response received/transmitted               interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINT1</name><displayName>FS_HCINT1</displayName><description>OTG_FS host channel-1 interrupt register           (OTG_FS_HCINT1)</description><addressOffset>0x128</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALL</name><description>STALL response received               interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAK</name><description>NAK response received               interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACK</name><description>ACK response received/transmitted               interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINT2</name><displayName>FS_HCINT2</displayName><description>OTG_FS host channel-2 interrupt register           (OTG_FS_HCINT2)</description><addressOffset>0x148</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALL</name><description>STALL response received               interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAK</name><description>NAK response received               interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACK</name><description>ACK response received/transmitted               interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINT3</name><displayName>FS_HCINT3</displayName><description>OTG_FS host channel-3 interrupt register           (OTG_FS_HCINT3)</description><addressOffset>0x168</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALL</name><description>STALL response received               interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAK</name><description>NAK response received               interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACK</name><description>ACK response received/transmitted               interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINT4</name><displayName>FS_HCINT4</displayName><description>OTG_FS host channel-4 interrupt register           (OTG_FS_HCINT4)</description><addressOffset>0x188</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWi