MaJerle/stm32f429/00-STM32_SVD/STM32F401x.svd
dth>1</bitWidth></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALL</name><description>STALL response received               interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAK</name><description>NAK response received               interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACK</name><description>ACK response received/transmitted               interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINT5</name><displayName>FS_HCINT5</displayName><description>OTG_FS host channel-5 interrupt register           (OTG_FS_HCINT5)</description><addressOffset>0x1A8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALL</name><description>STALL response received               interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAK</name><description>NAK response received               interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACK</name><description>ACK response received/transmitted               interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINT6</name><displayName>FS_HCINT6</displayName><description>OTG_FS host channel-6 interrupt register           (OTG_FS_HCINT6)</description><addressOffset>0x1C8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALL</name><description>STALL response received               interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAK</name><description>NAK response received               interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACK</name><description>ACK response received/transmitted               interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINT7</name><displayName>FS_HCINT7</displayName><description>OTG_FS host channel-7 interrupt register           (OTG_FS_HCINT7)</description><addressOffset>0x1E8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALL</name><description>STALL response received               interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAK</name><description>NAK response received               interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACK</name><description>ACK response received/transmitted               interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINTMSK0</name><displayName>FS_HCINTMSK0</displayName><description>OTG_FS host channel-0 mask register           (OTG_FS_HCINTMSK0)</description><addressOffset>0x10C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALLM</name><description>STALL response received interrupt               mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAKM</name><description>NAK response received interrupt               mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACKM</name><description>ACK response received/transmitted               interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NYET</name><description>response received interrupt               mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINTMSK1</name><displayName>FS_HCINTMSK1</displayName><description>OTG_FS host channel-1 mask register           (OTG_FS_HCINTMSK1)</description><addressOffset>0x12C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALLM</name><description>STALL response received interrupt               mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAKM</name><description>NAK response received interrupt               mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACKM</name><description>ACK response received/transmitted               interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NYET</name><description>response received interrupt               mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINTMSK2</name><displayName>FS_HCINTMSK2</displayName><description>OTG_FS host channel-2 mask register           (OTG_FS_HCINTMSK2)</description><addressOffset>0x14C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALLM</name><description>STALL response received interrupt               mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAKM</name><description>NAK response received interrupt               mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACKM</name><description>ACK response received/transmitted               interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NYET</name><description>response received interrupt               mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINTMSK3</name><displayName>FS_HCINTMSK3</displayName><description>OTG_FS host channel-3 mask register           (OTG_FS_HCINTMSK3)</description><addressOffset>0x16C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALLM</name><description>STALL response received interrupt               mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAKM</name><description>NAK response received interrupt               mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACKM</name><description>ACK response received/transmitted               interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NYET</name><description>response received interrupt               mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINTMSK4</name><displayName>FS_HCINTMSK4</displayName><description>OTG_FS host channel-4 mask register           (OTG_FS_HCINTMSK4)</description><addressOffset>0x18C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALLM</name><description>STALL response received interrupt               mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAKM</name><description>NAK response received interrupt               mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACKM</name><description>ACK response received/transmitted               interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NYET</name><description>response received interrupt               mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINTMSK5</name><displayName>FS_HCINTMSK5</displayName><description>OTG_FS host channel-5 mask register           (OTG_FS_HCINTMSK5)</description><addressOffset>0x1AC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALLM</name><description>STALL response received interrupt               mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAKM</name><description>NAK response received interrupt               mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACKM</name><description>ACK response received/transmitted               interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NYET</name><description>response received interrupt               mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINTMSK6</name><displayName>FS_HCINTMSK6</displayName><description>OTG_FS host channel-6 mask register           (OTG_FS_HCINTMSK6)</description><addressOffset>0x1CC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALLM</name><description>STALL response received interrupt               mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAKM</name><description>NAK response received interrupt               mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACKM</name><description>ACK response received/transmitted               interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NYET</name><description>response received interrupt               mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCINTMSK7</name><displayName>FS_HCINTMSK7</displayName><description>OTG_FS host channel-7 mask register           (OTG_FS_HCINTMSK7)</description><addressOffset>0x1EC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STALLM</name><description>STALL response received interrupt               mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NAKM</name><description>NAK response received interrupt               mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ACKM</name><description>ACK response received/transmitted               interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NYET</name><description>response received interrupt               mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_HCTSIZ0</name><displayName>FS_HCTSIZ0</displayName><description>OTG_FS host channel-0 transfer size           register</description><addressOffset>0x110</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>FS_HCTSIZ1</name><displayName>FS_HCTSIZ1</displayName><description>OTG_FS host channel-1 transfer size           register</description><addressOffset>0x130</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>FS_HCTSIZ2</name><displayName>FS_HCTSIZ2</displayName><description>OTG_FS host channel-2 transfer size           register</description><addressOffset>0x150</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>FS_HCTSIZ3</name><displayName>FS_HCTSIZ3</displayName><description>OTG_FS host channel-3 transfer size           register</description><addressOffset>0x170</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>FS_HCTSIZ4</name><displayName>FS_HCTSIZ4</displayName><description>OTG_FS host channel-x transfer size           register</description><addressOffset>0x190</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>FS_HCTSIZ5</name><displayName>FS_HCTSIZ5</displayName><description>OTG_FS host channel-5 transfer size           register</description><addressOffset>0x1B0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>FS_HCTSIZ6</name><displayName>FS_HCTSIZ6</displayName><description>OTG_FS host channel-6 transfer size           register</description><addressOffset>0x1D0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>FS_HCTSIZ7</name><displayName>FS_HCTSIZ7</displayName><description>OTG_FS host channel-7 transfer size           register</description><addressOffset>0x1F0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</re