MaJerle/stm32f429/00-STM32_SVD/STM32F401x.svd
setValue><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field></fields></register></registers></peripheral><peripheral><name>OTG_FS_DEVICE</name><description>USB on the go full speed</description><groupName>USB_OTG_FS</groupName><baseAddress>0x50000800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>FS_DCFG</name><displayName>FS_DCFG</displayName><description>OTG_FS device configuration register           (OTG_FS_DCFG)</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x02200000</resetValue><fields><field><name>DSPD</name><description>Device speed</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>NZLSOHSK</name><description>Non-zero-length status OUT               handshake</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DAD</name><description>Device address</description><bitOffset>4</bitOffset><bitWidth>7</bitWidth></field><field><name>PFIVL</name><description>Periodic frame interval</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>FS_DCTL</name><displayName>FS_DCTL</displayName><description>OTG_FS device control register           (OTG_FS_DCTL)</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>RWUSIG</name><description>Remote wakeup signaling</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SDIS</name><description>Soft disconnect</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GINSTS</name><description>Global IN NAK status</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>GONSTS</name><description>Global OUT NAK status</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TCTL</name><description>Test control</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>SGINAK</name><description>Set global IN NAK</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CGINAK</name><description>Clear global IN NAK</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SGONAK</name><description>Set global OUT NAK</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CGONAK</name><description>Clear global OUT NAK</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>POPRGDNE</name><description>Power-on programming done</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_DSTS</name><displayName>FS_DSTS</displayName><description>OTG_FS device status register           (OTG_FS_DSTS)</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000010</resetValue><fields><field><name>SUSPSTS</name><description>Suspend status</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>ENUMSPD</name><description>Enumerated speed</description><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field><field><name>EERR</name><description>Erratic error</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FNSOF</name><description>Frame number of the received               SOF</description><bitOffset>8</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>FS_DIEPMSK</name><displayName>FS_DIEPMSK</displayName><description>OTG_FS device IN endpoint common interrupt           mask register (OTG_FS_DIEPMSK)</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRCM</name><description>Transfer completed interrupt               mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>EPDM</name><description>Endpoint disabled interrupt               mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TOM</name><description>Timeout condition mask (Non-isochronous               endpoints)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ITTXFEMSK</name><description>IN token received when TxFIFO empty               mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>INEPNMM</name><description>IN token received with EP mismatch               mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>INEPNEM</name><description>IN endpoint NAK effective               mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_DOEPMSK</name><displayName>FS_DOEPMSK</displayName><description>OTG_FS device OUT endpoint common interrupt           mask register (OTG_FS_DOEPMSK)</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>XFRCM</name><description>Transfer completed interrupt               mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>EPDM</name><description>Endpoint disabled interrupt               mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>STUPM</name><description>SETUP phase done mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OTEPDM</name><description>OUT token received when endpoint               disabled mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS_DAINT</name><displayName>FS_DAINT</displayName><description>OTG_FS device all endpoints interrupt           register (OTG_FS_DAINT)</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>IEPINT</name><description>IN endpoint interrupt bits</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>OEPINT</name><description>OUT endpoint interrupt               bits</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>FS_DAINTMSK</name><displayName>FS_DAINTMSK</displayName><description>OTG_FS all endpoints interrupt mask register           (OTG_FS_DAINTMSK)</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IEPM</name><description>IN EP interrupt mask bits</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>OEPINT</name><description>OUT endpoint interrupt               bits</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DVBUSDIS</name><displayName>DVBUSDIS</displayName><description>OTG_FS device VBUS discharge time           register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x000017D7</resetValue><fields><field><name>VBUSDT</name><description>Device VBUS discharge time</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DVBUSPULSE</name><displayName>DVBUSPULSE</displayName><description>OTG_FS device VBUS pulsing time           register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x000005B8</resetValue><fields><field><name>DVBUSP</name><description>Device VBUS pulsing time</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DIEPEMPMSK</name><displayName>DIEPEMPMSK</displayName><description>OTG_FS device IN endpoint FIFO empty           interrupt mask register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>INEPTXFEM</name><description>IN EP Tx FIFO empty interrupt mask               bits</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>FS_DIEPCTL0</name><displayName>FS_DIEPCTL0</displayName><description>OTG_FS device control IN endpoint 0 control           register (OTG_FS_DIEPCTL0)</description><addressOffset>0x100</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>STALL</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>DIEPCTL1</name><displayName>DIEPCTL1</displayName><description>OTG device endpoint-1 control           register</description><addressOffset>0x120</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EPENA</name><description>EPENA</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDIS</name><description>EPDIS</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SODDFRM_SD1PID</name><description>SODDFRM/SD1PID</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>SD0PID/SEVNFRM</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>SNAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CNAK</name><description>CNAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>TXFNUM</name><description>TXFNUM</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>Stall</name><description>Stall</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>EPTYP</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>NAKSTS</name><description>NAKSTS</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EONUM_DPID</name><description>EONUM/DPID</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>USBAEP</name><description>USBAEP</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MPSIZ</name><description>MPSIZ</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPCTL2</name><displayName>DIEPCTL2</displayName><description>OTG device endpoint-2 control           register</description><addressOffset>0x140</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EPENA</name><description>EPENA</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDIS</name><description>EPDIS</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SODDFRM</name><description>SODDFRM</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>SD0PID/SEVNFRM</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>SNAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CNAK</name><description>CNAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>TXFNUM</name><description>TXFNUM</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>Stall</name><description>Stall</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>EPTYP</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>NAKSTS</name><description>NAKSTS</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EONUM_DPID</name><description>EONUM/DPID</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>USBAEP</name><description>USBAEP</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MPSIZ</name><description>MPSIZ</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPCTL3</name><displayName>DIEPCTL3</displayName><description>OTG device endpoint-3 control           register</description><addressOffset>0x160</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EPENA</name><description>EPENA</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDIS</name><description>EPDIS</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SODDFRM</name><description>SODDFRM</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>SD0PID/SEVNFRM</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>SNAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CNAK</name><description>CNAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>TXFNUM</name><description>TXFNUM</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>Stall</name><description>Stall</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>EPTYP</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>NAKSTS</name><description>NAKSTS</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EONUM_DPID</name><description>EONUM/DPID</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>USBAEP</name><description>USBAEP</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MPSIZ</name><description>MPSIZ</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field></fields></register><register><name>DOEPCTL0</name><displayName>DOEPCTL0</displayName><description>device endpoint-0 control           register</description><addressOffset>0x300</addressOffset><size>0x20</size><resetValue>0x00008000</resetValue><fields><field><name>EPENA</name><description>EPENA</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>EPDIS</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SNAK</name><description>SNAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CNAK</name><description>CNAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>Stall</name><description>Stall</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SNPM</name><description>SNPM</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>EPTYP</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAKSTS</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>USBAEP</name><description>USBAEP</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>MPSIZ</name><description>MPSIZ</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>DOEPCTL1</name><displayName>DOEPCTL1</displayName><description>device endpoint-1 control           register</description><addressOffset>0x320</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EPENA</name><description>EPENA</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDIS</name><description>EPDIS</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SODDFRM</name><description>SODDFRM</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>SD0PID/SEVNFRM</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>SNAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CNAK</name><description>CNAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>Stall</name><description>Stall</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SNPM</name><description>SNPM</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>EPTYP</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>NAKSTS</name><description>NAKSTS</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EONUM_DPID</name><description>EONUM/DPID</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>USBAEP</name><description>USBAEP</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MPSIZ</name><description>MPSIZ</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field></fields></register><register><name>DOEPCTL2</name><displayName>DOEPCTL2</displayName><description>device endpoint-2 control           register</description><addressOffset>0x340</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EPENA</name><description>EPENA</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDIS</name><description>EPDIS</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SODDFRM</name><description>SODDFRM</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>SD0PID/SEVNFRM</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>SNAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CNAK</name><description>CNAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>Stall</name><description>Stall</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SNPM</name><description>SNPM</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>EPTYP</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>NAKSTS</name><description>NAKSTS</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EONUM_DPID</name><description>EONUM/DPID</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>USBAEP</name><description>USBAEP</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MPSIZ</name><description>MPSIZ</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field></fields></register><register><name>DOEPCTL3</name><displayName>DOEPCTL3</displayName><description>device endpoint-3 control           register</description><addressOffset>0x360</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EPENA</name><description>EPENA</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDIS</name><description>EPDIS</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SODDFRM</name><description>SODDFRM</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>SD0PID/SEVNFRM</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>SNAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CNAK</name><description>CNAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>Stall</name><description>Stall</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SNPM</name><description>SNPM</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</ac