MaJerle/stm32f429/00-STM32_SVD/STM32F401x.svd
cess></field><field><name>EPTYP</name><description>EPTYP</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>NAKSTS</name><description>NAKSTS</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EONUM_DPID</name><description>EONUM/DPID</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>USBAEP</name><description>USBAEP</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MPSIZ</name><description>MPSIZ</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPINT0</name><displayName>DIEPINT0</displayName><description>device endpoint-x interrupt           register</description><addressOffset>0x108</addressOffset><size>0x20</size><resetValue>0x00000080</resetValue><fields><field><name>TXFE</name><description>TXFE</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INEPNE</name><description>INEPNE</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>ITTXFE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>TOC</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPINT1</name><displayName>DIEPINT1</displayName><description>device endpoint-1 interrupt           register</description><addressOffset>0x128</addressOffset><size>0x20</size><resetValue>0x00000080</resetValue><fields><field><name>TXFE</name><description>TXFE</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INEPNE</name><description>INEPNE</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>ITTXFE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>TOC</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPINT2</name><displayName>DIEPINT2</displayName><description>device endpoint-2 interrupt           register</description><addressOffset>0x148</addressOffset><size>0x20</size><resetValue>0x00000080</resetValue><fields><field><name>TXFE</name><description>TXFE</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INEPNE</name><description>INEPNE</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>ITTXFE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>TOC</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPINT3</name><displayName>DIEPINT3</displayName><description>device endpoint-3 interrupt           register</description><addressOffset>0x168</addressOffset><size>0x20</size><resetValue>0x00000080</resetValue><fields><field><name>TXFE</name><description>TXFE</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INEPNE</name><description>INEPNE</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>ITTXFE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>TOC</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DOEPINT0</name><displayName>DOEPINT0</displayName><description>device endpoint-0 interrupt           register</description><addressOffset>0x308</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000080</resetValue><fields><field><name>B2BSTUP</name><description>B2BSTUP</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>OTEPDIS</name><description>OTEPDIS</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>STUP</name><description>STUP</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DOEPINT1</name><displayName>DOEPINT1</displayName><description>device endpoint-1 interrupt           register</description><addressOffset>0x328</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000080</resetValue><fields><field><name>B2BSTUP</name><description>B2BSTUP</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>OTEPDIS</name><description>OTEPDIS</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>STUP</name><description>STUP</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DOEPINT2</name><displayName>DOEPINT2</displayName><description>device endpoint-2 interrupt           register</description><addressOffset>0x348</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000080</resetValue><fields><field><name>B2BSTUP</name><description>B2BSTUP</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>OTEPDIS</name><description>OTEPDIS</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>STUP</name><description>STUP</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DOEPINT3</name><displayName>DOEPINT3</displayName><description>device endpoint-3 interrupt           register</description><addressOffset>0x368</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000080</resetValue><fields><field><name>B2BSTUP</name><description>B2BSTUP</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>OTEPDIS</name><description>OTEPDIS</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>STUP</name><description>STUP</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DIEPTSIZ0</name><displayName>DIEPTSIZ0</displayName><description>device endpoint-0 transfer size           register</description><addressOffset>0x110</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>2</bitWidth></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field></fields></register><register><name>DOEPTSIZ0</name><displayName>DOEPTSIZ0</displayName><description>device OUT endpoint-0 transfer size           register</description><addressOffset>0x310</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>STUPCNT</name><description>SETUP packet count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field></fields></register><register><name>DIEPTSIZ1</name><displayName>DIEPTSIZ1</displayName><description>device endpoint-1 transfer size           register</description><addressOffset>0x130</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MCNT</name><description>Multi count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field></fields></register><register><name>DIEPTSIZ2</name><displayName>DIEPTSIZ2</displayName><description>device endpoint-2 transfer size           register</description><addressOffset>0x150</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MCNT</name><description>Multi count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field></fields></register><register><name>DIEPTSIZ3</name><displayName>DIEPTSIZ3</displayName><description>device endpoint-3 transfer size           register</description><addressOffset>0x170</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MCNT</name><description>Multi count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field></fields></register><register><name>DTXFSTS0</name><displayName>DTXFSTS0</displayName><description>OTG_FS device IN endpoint transmit FIFO           status register</description><addressOffset>0x118</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space               available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DTXFSTS1</name><displayName>DTXFSTS1</displayName><description>OTG_FS device IN endpoint transmit FIFO           status register</description><addressOffset>0x138</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space               available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DTXFSTS2</name><displayName>DTXFSTS2</displayName><description>OTG_FS device IN endpoint transmit FIFO           status register</description><addressOffset>0x158</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space               available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DTXFSTS3</name><displayName>DTXFSTS3</displayName><description>OTG_FS device IN endpoint transmit FIFO           status register</description><addressOffset>0x178</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space               available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DOEPTSIZ1</name><displayName>DOEPTSIZ1</displayName><description>device OUT endpoint-1 transfer size           register</description><addressOffset>0x330</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>RXDPID_STUPCNT</name><description>Received data PID/SETUP packet               count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field></fields></register><register><name>DOEPTSIZ2</name><displayName>DOEPTSIZ2</displayName><description>device OUT endpoint-2 transfer size           register</description><addressOffset>0x350</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>RXDPID_STUPCNT</name><description>Received data PID/SETUP packet               count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field></fields></register><register><name>DOEPTSIZ3</name><displayName>DOEPTSIZ3</displayName><description>device OUT endpoint-3 transfer size           register</description><addressOffset>0x370</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>RXDPID_STUPCNT</name><description>Received data PID/SETUP packet               count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field></fields></register></registers></peripheral><peripheral><name>OTG_FS_PWRCLK</name><description>USB on the go full speed</description><groupName>USB_OTG_FS</groupName><baseAddress>0x50000E00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>FS_PCGCCTL</name><displayName>FS_PCGCCTL</displayName><description>OTG_FS power and clock gating control           register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>STPPCLK</name><description>Stop PHY clock</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>GATEHCLK</name><description>Gate HCLK</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PHYSUSP</name><description>PHY Suspended</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>FLASH</name><description>FLASH</description><groupName>FLASH</groupName><baseAddress>0x40023C00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>FLASH</name><description>FLASH global interrupt</description><value>4</value></interrupt><registers><register><name>ACR</name><displayName>ACR</displayName><description>Flash access control register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>LATENCY</name><description>Latency</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PRFTEN</name><description>Prefetch enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ICEN</name><description>Instruction cache enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCEN</name><description>Data cache enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ICRST</name><description>Instruction cache reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>DCRST</name><description>Data cache reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>KEYR</name><displayName>KEYR</displayName><description>Flash key register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>KEY</name><description>FPEC key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>OPTKEYR</name><displayName>OPTKEYR</displayName><description>Flash option key register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>OPTKEY</name><description>Option byte key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>Status register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EOP</name><description>End of operation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OPERR</name><description>Operation error</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WRPERR</name><description>Write protection error</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PGAERR</name><description>Programming alignment               error</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PGPERR</name><description>Programming parallelism               error</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PGSERR</name><description>Programming sequence error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BSY</name><description>Busy</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>CR</name><displayName>CR</displayName><description>Control register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x80000000</resetValue><fields><field><name>PG</name><description>Programming</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SER</name><description>Sector Erase</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MER</name><description>Mass Erase</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SNB</name><description>Sector number</description><bitOffset>3</bitOffset><bitWidth>4</bitWidth></field><field><name>PSIZE</name><description>Program size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>STRT</name><description>Start</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>EOPIE</name><description>End of operation interrupt               enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRIE</name><description>Error interrupt enable</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>LOCK</name><description>Lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OPTCR</name><displayName>OPTCR</displayName><description>Flash option control register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000014</resetValue><fields><field><name>OPTLOCK</name><description>Option lock</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTSTRT</name><description>Option start</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>BOR_LEV</name><description>BOR reset Level</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>WDG_SW</name><description>WDG_SW User option bytes</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>nRST_STOP</name><description>nRST_STOP User option               bytes</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>nRST_STDBY</name><description>nRST_STDBY User option               bytes</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>RDP</name><description>Read protect</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>nWRP</name><description>Not write protect</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field></fields></register></registers></peripheral><peripheral><name>EXTI</name><description>External interrupt/event       controller</description><groupName>EXTI</groupName><baseAddress>0x40013C00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TAMP_STAMP</name><description>Tamper and TimeStamp interrupts through the
